<template>
    <div>
        <div v-if="! have">
            <Alert show-icon>
                申请直播间
                <Icon type="ios-lightbulb-outline" slot="icon"></Icon>
                <template slot="desc">
                    《课乎直播个人直播协议》，是上海课乎互娱文化有限公司（以下简称“我方”）和主播（以下称“你”或“你方”）所约定的规范双方权利和义务的具有法律效力的电子协议，下称“本协议”。你方勾选“我同意”或点击“我已阅读并遵守该协议”按钮，即表示你方已经仔细阅读、充分理解并完全地毫无保留地接受本协议的所有条款。

                    第一条 总则
                    1、你方根据我方注册要求及规则，在我方合法经营的课乎直播平台（以下简称“平台”）上申请成为我方游戏主播（或称“游戏解说员”，本协议下“主播”均亦指“解说”），为我方平台用户提供在线游戏解说视频内容的直播服务，你方在我方平台提供服务期间均应视为协议期内。我方不事先审核前述被上载的、由你方参与、编辑、制作的视频内容，也不主动对该等视频进行任何编辑、整理、修改、加工。
                    2、签署本协议前，你方已充分了解我方之各项规则及要求，且有条件及有能力、资格履行本协议约定的主播职责及义务。本协议对你方构成有效的、带有约束力的、可强制执行的法定义务，你方对本协议下所有条款及定义等内容均已明确知悉，并无疑义。
                    3、你方承诺并声明在为我方提供服务时符合所在地法律的相关规定，不得以履行本协议名义从事其他违反中国及所在地法律规定的行为。
                    4、你方与我方不构成任何劳动法律层面的雇佣、劳动、劳务关系。
                    5、未经我方事先书面同意，你方不得在第三方竞争平台上从事任何与游戏解说相关的行为（包括但不限于：视频直播互动、同步推流、发布游戏解说视频或其余类似行为）。前述第三方竞争平台指：与我方及我方关联公司有竞争关系的第三方直播平台，包括但不限于虎牙直播、战旗直播、斗鱼直播、火猫直播、风云直播、播狗、新浪看游戏、QT、17173、PPTV、TGA、AZUBU、TWITCH等及其相关联的直播网站。
                    6、你方在我方平台提供直播服务期间产生的所有成果（包括但不限于游戏解说视频、音频，及与本协议事项相关的任何文字、视频、音频等，以下统称“主播成果”）的全部知识产权（包括但不限于著作权、商标权等知识产权以及相关的一切衍生权利）、所有权及相关权益，由我方享有。协议期内及协议期满后，我方可以任何方式使用主播成果并享有相应的收益，未经我方事先书面同意，你方不得自行或提供、授权給任何第三方以任何方式使用（包括但不限于在视频平台、游戏直播平台、游戏网站等其他任何平台发布）及获得任何收益。

                    第二条 我方权利义务
                    1、我方有权制定平台运营制度及对主播的管理规则，有权对你方进行管理和监督，有权根据运营情况对相应规则做出调整或变更，你方对此表示理解和同意。
                    2、我方有权对你方进行考察、评判，以确立（取消）对你方的奖励或处罚，具体考察项目及标准由我方另行制定，无需额外征得你方同意。如我方希望与你方就游戏直播事项进行深入合作的，可由双方进行友好协商另行签订正式的游戏主播合作协议。
                    3、我方有权对你方的服务提出改进建议和意见，你方应在收到我方的建议和意见后【3】个工作日内进行相应的整改，否则我方有权相应扣减应支付给你方的服务费用（若有）。
                    4、我方对你方进行的游戏解说直播相关事宜拥有最终决定权。
                    5、我方有权使用你方的的名称（包括但不限于你方真实姓名、笔名、网名、曾用名及任何代表你方身份的文字符号）、肖像（包括但不限于真人肖像及卡通肖像等）进行我方平台的各类宣传。
                    6、我方负责提供平台技术服务支持，同时负责平台服务费用结算（若有）。

                    第三条 你方权利义务
                    1、你方须年满16周岁（未满16周岁的未成年人应在法定监护人的陪同下审阅本协议，并在接受本协议前取得父母（监护人）的同意。若父母（监护人）希望未成年人（尤其是十岁以下子女）得以提供本协议约定的游戏解说直播服务的，必须以法定监护人身份加以判断该等服务内容是否符合于未成年人），你方承诺不会因执行本协议损害任何第三方合法利益，你方接受并履行本协议不违反任何对你有约束力的法律文件，亦不会使我方对任何第三方承担任何责任。
                    2、你方自己承担进行游戏解说直播所需要的网络、支持视频和语音的设备，并保证直播图像清、语音质量清晰、稳定。
                    3、你方承诺直播房间必须用作游戏解说直播或甲方根据平台发展需要而增加的其他业务用途，不得用于其他任何非游戏解说直播性质及其他非甲方允许的活动。
                    4、你方开展本协议项下游戏解说直播事项和/或在本平台上发布的所有信息/资讯/言论/内容等均不得含有任何违反中华人民共和国有关法律、法规及规定的内容，包括但不限于危害国家安全、淫秽色情、虚假、违法、诽谤（包括商业诽谤）、非法恐吓或非法骚扰、侵犯他人知识产权、人身权、商业秘密或其他合法权益以及有违公序良俗的内容或指向这些内容的链接。
                    5、你方承诺积极维护我方及我方平台形象，你方不会做出有损于我方及/或我方平台形象或利益的行为，本协议期内及协议终止后，你方不会通过任何渠道（包括但不限于网站、博客、微博、微信、QQ聊天群、玩家作者聚会等）暗示或发布不利于我方及/或我方平台的言论。
                    6、未经我方书面同意，你方不得在任何场合以任何形式（包括但不限于文字、口播、视频贴片等）提及第三方竞争平台的相关信息，不得引导或为我方平台现有用户、其他主播及我方员工进入其他第三方竞争平台提供任何信息或便利，包括但不限于提供联络上的协助、进行说服工作等。

                    第四条 保密制度
                    1、你方应严格遵守我方的保密制度，承诺无限期保守我方的商业秘密。因你方违反约定使用或披露我方商业秘密和信息使我方遭受任何名誉、声誉或经济上的、直接或间接的损失，你方应赔偿我方人民币【100000】元违约金，不足以弥补我方损失的，你方还应赔偿我方损失。

                    商业秘密是指由我方提供的、或者你方在双方合作期间了解到的、或者我方对第三方承担保密义务的，与我方业务有关的，能为我方带来经济利益，具有实用性的、非公知的所有信息，包括（但不限于）：技术信息、经营信息和与我方行政管理有关的信息和文件（含本协议及相关协议内容）、你方从我方获得的服务费用的金额和结算方式、标准、权利归属方式、授权方式、客户名单、其他解说员的名单、联系方式、服务费用、我方工作人员名单等不为公众所知悉的信息。

                    2、你方应严格遵守本协议，未经我方书面授权或同意，对我方的商业秘密不得：
                    （1）以任何方式向第三方或不特定的公众进行传播、泄露；
                    （2）为非本协议的目的而使用我方的商业秘密。
                    3、本协议终止后，你方应将我方商业秘密悉数返还我方，或在我方监督下，将记载我方商业秘密的全部文件销毁。
                    4、本条规定在本协议终止后仍然有效。

                    第五条 协议的变更、解除、终止
                    1、我方有权在必要时变更、终止、中止本协议，并在相关页面进行通知，变更后的协议一旦在相关的页面上公布即有效代替原来的协议。本协议条款变更后，如你方继续为我方平台用户提供游戏解说等直播服务，即视为你方已知悉并接受变更后的协议。如你方不同意我方对本协议的所作的任何变更，你方应立即书面通知我方并停止在我方平台进行的任何直播服务。
                    2、双方就解除本协议协商一致即可终止协议。
                    3、你方有下列情形之一，我方可以立即解除本协议，不需要提前通知：
                    （1）我方发现你方违反对本协议所做的声明与承诺的；
                    （2）因你方个人行为直接或间接给对我方利益造成重大损害的；
                    （3）违反国家法律法规的；
                    （4）违反本协议规定的其它义务；
                    （5）以消极、不作为等不符合我方要求的方式履行本协议的（即使未构成违约），经我方通知后【10】日内仍未改正的；
                    （6）因异常情形的出现，我方认为你方不适合进行本协议下服务事项，经我方通知后【10】日内异常情形仍未消除的；
                    （7）因我方业务调整，不再进行个人主播业务的。
                    4、本协议终止后，不影响本协议约定的主播成果的权利归属，我方仍为本协议所涉主播成果的权利人；如果根据中国法律，上述之约定无法实际履行的，你方同意并承诺自本协议终止或双方后续合作中止、终止或解除之日起五年内不将主播成果的全部或部分的发布、使用等相关的权利（包括但不限于《中华人民共和国著作权法》第十条第一款第（五）项至第（十七）项规定的著作权权利）自行行使、转让或授权许可于任何第三方。

                    第六条 违约责任
                    1、任何由于你方声明不实或违反其声明承诺事项导致他方向我方提起诉讼、索赔及/或导致我方声誉受损之后果，你方将承担我方因此产生的全部直接及间接费用、损失及赔偿，其中包括我方为诉讼支付的有关费用及律师费。
                    2、除本协议另有约定外，你方违反本协议下任何规定的，我方有权单方面扣除你方相关服务费用，及要求你方返还我方已支付的全部或部分服务费用；不足以弥补我方损失的，你方还应赔偿我方所有损失。
                    3、若你方提供的服务不符合我方的要求，我方有权不予支付相关服务费用。

                    第七条 争议处理
                    因履行本协议而产生的任何争议，双方均应本着友好协商的原则加以解决。协商解决未果，任何一方均可以提请本协议签订地有管辖权的人民法院诉讼解决。

                    第八条 其他
                    1、本协议未尽事宜，或与国家、地方有关规定相悖的，按有关规定执行。
                    2、本协议签订地：上海市宝山区。
                    本协议共八条，本行以下无协议正文。

                    *特别声明

                    鉴于我国《合同法》第39条规定：采用格式条款订立合同的，提供格式条款的一方应当遵循公平原则确定当事人之间的权利和义务，并采取合理的方式提请对方注意免除或者限制其责任的条款，按照对方的要求，对该条款予以说明。 我方在此依法做出特别声明如下：

                    法定的我方采取合理的方式提请你方注意的义务将通过如下方式实现：在本协议中我方以明确的足以引起你方注意的加重字体、斜体、下划线、颜色标记等合理方式提醒你方注意相关条款（需要强调的是，还包括你方应特别注意任何未明确标记的含有“不承担”、“免责”“不得”等形式用语的条款），该等条款的确认将导致你方在特定情况下的被动、不便、损失，包括但不限于本合同第5条、第6条、第12条等，请你方在确认同意本协议之前再次阅读上述条款。双方确认上述条款非属于《合同法》第40条规定的“免除其责任、加重对方责任、排除对方主要权利的”的条款，我方尊重你方的权利尤其是诉讼的权利，但作为全球运营的公司，我方在尊重你方诉讼权利的同时建议诉讼管辖地法院为上海浦东新区法院，而你方选择同意合同并提供服务即视为双方对此约定达成了一致意见。

                    法定的我方向你方说明这些条款的义务将通过如下方式实现：而你方如有任何需要说明条款的要求，请立即停止向我方平台用户提供游戏解说等直播服务，同时立即致电书面通知我方，若你方未致电或发送有说明条款要求的邮件至我方而选择同意该协议，则双方在此确认我方已依法履行了根据你方要求对相关条款进行说明的法定义务，我方已给予你方充足的时间与充分的选择权来决定是否缔结本协议。

                    鉴于我方已依法明确了上述条款、履行了格式条款制订方的义务，你方点击同意或下一步，将被视为且应当被视为你方已经完全注意并同意了本协议所有条款尤其是提醒你方注意的条款的合法性及有效性，你方不应当以我方未对格式条款以合理方式提醒你方注意或未根据你方要求尽到说明义务为理由而声称或要求法院或其它任何第三方确认相关条款非法或无效。
                </template>
            </Alert>
            <Button type="success" long @click="apply">我接受规则并申请直播间</Button>
        </div>
        <div v-if="have">
            <div class="form-horizontal setroom">
                <Form>
                    <div class="form-group">
                        <label class="col-md-2 control-label">房间ID</label>
                        <div class="col-md-4">
                            <p class="form-control-static">{{room.id}}</p>
                        </div>
                    </div>
                    <div class="form-group">
                        <label class="col-md-2 control-label">标题</label>
                        <div class="col-md-4">
                            <FormItem prop="name">
                                <Input type="text" autocomplete="off" v-model="room.title" placeholder="用户名">
                                </Input>
                            </FormItem>
                        </div>
                        <div class="col-md-2">
                            <Button type="dashed" @click="change('changeRoomTitle','title')">保存</Button>
                        </div>
                    </div>
                    <div class="form-group">
                        <label class="col-md-2 control-label">房间公告</label>
                        <div class="col-md-4">
                            <FormItem prop="name">
                                <Input type="text" autocomplete="off" v-model="room.announcement" placeholder="公告">
                                </Input>
                            </FormItem>
                        </div>
                        <div class="col-md-2">
                            <Button type="dashed" @click="change('changeRoomAnnouncement','announcement')">保存</Button>
                        </div>
                    </div>

                    <div class="form-group">
                        <label class="col-md-2 control-label">直播分类</label>
                        <div class="col-md-10">
                            <p class="form-control-static">
                                {{ room.type }}
                            </p>
                        </div>
                    </div>

                    <div class="form-group">
                        <label class="col-md-2 control-label">是否公开</label>
                        <div class="col-md-4">
                            <FormItem prop="name">
                                <Input type="text" autocomplete="off" v-model="room.scope" placeholder="公开">
                                </Input>
                            </FormItem>
                        </div>
                        <div class="col-md-2">
                            <Button type="dashed" @click="change('changeRoomScope','scope')">保存</Button>
                        </div>
                    </div>

                    <div class="form-group">
                        <label class="col-md-2 control-label">直播间密码</label>
                        <div class="col-md-4">
                            <FormItem prop="name">
                                <Input type="text" autocomplete="off" v-model="room.password" placeholder="设定密码">
                                </Input>
                            </FormItem>
                        </div>
                        <div class="col-md-2">
                            <Button type="dashed" @click="change('changeRoomPassWord','password')">保存</Button>
                        </div>
                    </div>

                    <div class="form-group">
                        <label class="col-md-2 control-label">创建时间</label>
                        <div class="col-md-10">
                            <p class="form-control-static">
                                {{ room.created_at }}
                            </p>
                        </div>
                    </div>

                    <div class="form-group">
                        <label class="col-md-2 control-label">最后一次直播时间 </label>
                        <div class="col-md-10">
                            <p class="form-control-static">
                                {{ room.updated_at }}
                            </p>
                        </div>
                    </div>

                    <div class="form-group" style="margin-top: 50px;">
                        <div class="col-md-10 col-md-offset-2">
                            <router-link class="btn btn-success" :to="'/'+room.id">进入我的直播间</router-link>
                        </div>
                    </div>
                </Form>
            </div>
        </div>
    </div>
</template>

<script>
    export default {
        data() {
            return {
                have: true,
                room: {}
            }
        },
        mounted() {
            this.$http.post('/api/haveroom').then(res => {
                if (res.data.code == 4005)
                {
                    this.have = true
                    this.$http.post('/api/room/info').then(res => {
                        if (res.data.code == 4007)
                        {
                            this.room = res.data.data
                        }
                    })
                } else {
                    this.have = false
                }
            })

        },
        methods: {
            apply() {
                this.$http.post('/api/apply/liveroom').then(res => {
                    this.user = res.data
                })
            },
            change(functionName,name) {
                let param = new URLSearchParams();
                param.append(name, eval('this.room.'+name));
                this.$http.post('/api/change/'+functionName, param).then(res => {
                    // nothing to do ~
                })
            }
        }
    }
</script>